Revit 2024 API
ElectricalSetting.WireTypes Property
 Get all wire type definition information of the project.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public WireTypeSet WireTypes { get; }
Visual Basic
Public ReadOnly Property WireTypes As WireTypeSet
	Get
Visual C++
public:
property WireTypeSet^ WireTypes {
	WireTypeSet^ get ();
}
See Also
ElectricalSetting Class
Autodesk.Revit.DB.Electrical Namespace